# IFCParameter Template Set In Session Template Document Method

Source: https://www.revitapidocs.com/2026/6792865b-e40c-044c-164b-de5f3c1088b3.htm

---

| IFCParameter Template Set In Session Template Document Method |
| --- |

Set document for in\-session template.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void SetInSessionTemplateDocument(
	Document document
)
```

```
Public Sub SetInSessionTemplateDocument (
	document As Document
)
```

```
public:
void SetInSessionTemplateDocument(
	Document^ document
)
```

```
member SetInSessionTemplateDocument :
        document : Document -> unit
```

#### Parameters

document Document
:   The Revit document.

Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non\-optional argument was null |
| InvalidOperationException | The template is not an is\-session. |

Remarks The document is used for non built\-in parameters mapping. See Also

#### Reference

IFCParameterTemplate Class Autodesk.Revit.DB Namespace